       IDENTIFICATION DIVISION.
       PROGRAM-ID. AUDIT-TRAIL.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT AUDIT-FILE
               ASSIGN TO ACCT.INTEREST.VSAM
               ORGANIZATION IS INDEXED.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY INTEREST-COPY.
       PROCEDURE DIVISION.
       MAIN-LOGIC.
           READ AUDIT-FILE
           STOP RUN.
