       IDENTIFICATION DIVISION.
       PROGRAM-ID. CREDIT-CHECK.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY INTEREST-COPY.
       PROCEDURE DIVISION.
       MAIN-LOGIC.
           IF WS-INTEREST > 50000 MOVE 'REVIEW' TO WS-STATUS END-IF
           STOP RUN.
