       IDENTIFICATION DIVISION.
       PROGRAM-ID. INTEREST-REPORT.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY INTEREST-COPY.
       PROCEDURE DIVISION.
       MAIN-LOGIC.
           MOVE WS-INTEREST TO REPORT-LINE
           STOP RUN.
