       01 INTEREST-RECORD.
          05 WS-PRINCIPAL    PIC 9(9)V9(2)  COMP-3.
          05 WS-TERM         PIC 9(4)       COMP-3.
          05 WS-INTEREST     PIC 9(11)V9(2) COMP-3.
          05 WS-COMPOUND     PIC 9(11)V9(4) COMP-3.
