       IDENTIFICATION DIVISION.
       PROGRAM-ID. MORTGAGE-CALC.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY INTEREST-COPY.
       PROCEDURE DIVISION.
       MAIN-LOGIC.
           COMPUTE WS-INTEREST = WS-PRINCIPAL * 0.03 * WS-TERM
           STOP RUN.
