       IDENTIFICATION DIVISION.
       PROGRAM-ID. PAYROLL-REPORT.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT PAY-FILE
               ASSIGN TO ACCT.INTEREST.VSAM
               ORGANIZATION IS INDEXED.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-AMOUNT PIC 9(9)V9(2).
       PROCEDURE DIVISION.
       MAIN-LOGIC.
           READ PAY-FILE
           STOP RUN.
