       IDENTIFICATION DIVISION.
       PROGRAM-ID. STATEMENT-GEN.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY INTEREST-COPY.
       PROCEDURE DIVISION.
       MAIN-LOGIC.
           MOVE WS-INTEREST TO WS-STATEMENT-AMT
           STOP RUN.
